[
    {
        "cfp_type": "workshop",
        "title": "Build ML Systems with just Python and free Serverless Services",
        "author": "Jim Dowling",
        "others": "",
        "abstract": "We will build an end-to-end ML system that predicts wave heights at a beach in only Python. It will be hosted on free serverless services - Github Actions, Streamlit, and Hopsworks. It will be a continually improving ML system that keeps collecting more data, making better  predictions.",
        "bio": "Jim Dowling is CEO of Hopsworks and an Associate Professor at KTH Royal Institute of Technology. He is one of the main developers of the open-source Hopsworks platform, a horizontally scalable data platform for machine learning that includes the industry’s first Feature Store",
        "level": "Intermediate",
        "twitter": "twitter.com/jim_dowling",
        "linkedin": "https://www.linkedin.com/in/jim-dowling-206a98",
        "picture": "images/speakers/Jim_Downling.jpg"
    },
    {
        "cfp_type": "workshop",
        "title": "Building serverless apps with Python",
        "author": "Ivica Kolenkaš",
        "others": "",
        "abstract": "The workshop will guide participants through the process of building and deploying",
        "bio": "Ivica Kolenkaš is a system engineer by day, Python coder by night who works with companies to help them run their applications on AWS using infrastructure-as-code and common sense.",
        "level": "Novice",
        "twitter": "twitter.com/nekybrate",
        "linkedin": "https://www.linkedin.com/in/ivica-kolenka%C5%A1-8b333895",
        "picture": "images/speakers/Ivica_Kolenkas.jpg"
    },
    {
        "cfp_type": "workshop",
        "title": "Build tailored ML Applications with Lightning.ai",
        "author": "Krishna Kalyan",
        "others": "",
        "abstract": "Build models and AI-powered cloud applications using Lightning App \ntemplates without DIY infrastructure, cost management, scaling, and \nother headaches. Lightning framework gives ML Researchers and Data \nScientists, the fastest & most flexible way to iterate on ML \nresearch ideas and deliver scalable ML systems with the performance \nenterprises requires at the same time.",
        "bio": "Machine Learning Engineer with Lightning.ai. I am interested in Machine Learning and Distributed Systems. In my free time I contribute to torchaudio and pytorch lightning.",
        "level": "Novice",
        "twitter": "https://twitter.com/krishnakalyan3",
        "linkedin": "https://www.linkedin.com/in/krishnakalyan3/",
        "instagram": "www.instagram.com/krishnakalyan3/",
        "picture": "images/speakers/Krishna_Kalyan.jpg"
    },
    {
        "cfp_type": "workshop",
        "title": "Reproducible data pipelines with PyTorch",
        "author": "Valerio Maggio",
        "others": "",
        "abstract": "In this tutorial we will dive into the main features and abstractions provided by the **PyTorch** framework to define complex data pipelines for machine learning. We will explore multiple examples using `torch.utils.data` and the latest `torchdata` with insights and best practice for reproducible data and evaluation pipelines.",
        "bio": "Valerio Maggio is a Researcher, Data scientist, and fellow at the Software Sustainability Institute, as well as a casual \"Magic: The Gathering\" wizard. He holds a Ph.D. in Computer Science with a thesis on Machine Learning for Software Maintainability, and he is currently working in Anaconda, inc. as Senior Developer Advocate. Valerio is well versed into open source software, and best software development practice, specifically focusing on scalable and reproducible machine learning pipelines.  Valerio is an active member of the Python community: over the years he has led the organisation of many international conferences like PyCon/PyData Italy/EuroPython, and EuroSciPy. ",
        "level": "Intermediate",
        "twitter": "twitter.com/leriomaggio",
        "linkedin": "https://www.linkedin.com/in/valeriomaggio/",
        "instagram": "www.instagram.com/leriomaggio/",
        "picture": "images/speakers/Valerio_Maggio.jpg"
    },
    {
        "cfp_type": "workshop",
        "title": "Build a switchboard in an hour ☎️",
        "author": "Carolina J. Säll and Victoria Wagman",
        "others": "Victoria Wagman",
        "abstract": "We will be building a small switchboard together which will allow for\n dynamic call forwarding. By building your own switchboard you’ll also \nhave the possibility to customize it in a way that fits you our your \ncompany needs, like adding an answering machine function or trigger.\nautomatic call up for missed calls.  Audience Level: Beginners, intermediate, Advanced\nPreparations: \n<ul>\n <li>A 46elks account, <a href=\"https://46elks.se/skapa-konto/ws-pycon2022\">here's a link</a> with some credits to test your answering machine. </li>\n<li>A computer and be excited to code some cool stuff 👩🏻‍💻.</li>\n</ul>",
        "bio": "<b>Carolina:</b> I’m Carolina, a part of PyLadies Stockholm. I work as a developer at 46elks,\n love problem solving in design, code and life! Get energy by meeting \nnew people and is curious about almost everything on this planet 🌍. Taking a Python course together with PyLadies Stockholm during the fall, excited to test my new skills out during PyCon 🐍.\n<br />\n<b>Victoria:</b> Developer and CEO at 46elks. Sees opportunities \neverywhere. Safe in the terminal and warmly recommend vim. Happy to talk\n about how we can contribute to a kinder, nicer and more just world.",
        "level": "Beginners, intermediate, Advanced",
        "twitter": "twitter.com/carolinajsall ",
        "linkedin": "http://www.linkedin.com/in/carolina-j-s%C3%A4ll-40631452 https://www.linkedin.com/in/victoria-wagman-%E2%99%A0%EF%B8%8F-2919671a5/",
        "instagram": "www.instagram.com/46elks/",
        "picture": "images/speakers/Carolina_and_Victoria.jpg"
    },
    {
        "cfp_type": "talk",
        "title": "Chasing Birds with Code: Using Python and AI to Liberate our Balconies",
        "author": "Chayim Kirshen and Meir Shpilraien",
        "others": "Meir",
        "abstract": "In 2022 birds swarmed our neighbourhood. We wanted to chase them away\nsustainably, kindly, and without using metal spikes. In this talk,\nwe'll learn how to disperse birds safely, with software using Python,\nAI, and a Raspberry PI.",
        "bio": "Chayim is a veteran of the software industry with over twenty years of experience. He has helped release several operating systems, contributed to a variety of open-source projects, and built and maintained multiple datacenters, operations teams, and products. With experience contributing at SGI, Autodesk, Novell, SuSE, and others, Chayim has helped several organizations scale their codebase, development teams, and the organization itself - while increasing both the speed and quality of software releases.\nToday, Chayim works for Redis as the Client and Ecosystem manager. He mentors new developers, and spends time slipping between languages, both spoken and code. He's also been writing Python since version 1.4.\n<br />\nMeir owns MSC in computer science specialised at distributed algorithms. Currently, Meir is working at Redis as a software architect, responsible for Redis modules development. He is an active contributor of Redis core and maintainer of RediSearch and RedisGears.",
        "level": "Intermediate",
        "picture": "images/person-dummy.jpg"
    },
    {
        "cfp_type": "talk",
        "title": "Detecting Wireless Jammers and Hackers with JADE",
        "author": "Caner Kilinc",
        "others": "",
        "abstract": "Wireless  jammer activity from malicious or malfunctioning devices cause significant disruption to mobile network services and user QoE degradation. In practice, detection of such activity is manually intensive and costly, taking days and weeks after the jammer activation to detect it. We present a novel data-driven jammer detection framework termed JADE that leverages continually collected operator-side cell-level KPIs to automate this process.",
        "bio": "CANER KILINC  Co-founder and chairman of The AI Community Sweden (<a href=\"https://www.TheAIcommunity.se\">www.TheAIcommunity.se</a>), helps customers to reduce OPEX and assure service quality at Ericsson AI Research where Caner is leading multi-million dollar budgets, global data-driven projects, and AI teams. Furthermore, Caner\n is a hands-on data scientist and AI/ML specialist with a proven track \nof achievements in translating data-driven automation strategies into \nrealization. Caner in his free time likes \nexploring blockchain, teaching applied Data Science, organizing Global \nAI Challenges at The Alan Turing Institute, and blog posting about \nApplied Advanced  AI models with TensorFlow.",
        "level": "Intermediate",
        "linkedin": "https://www.linkedin.com/in/caner-kilinc/",
        "picture": "images/speakers/Caner_Kilinc.jpg"
    },
    {
        "cfp_type": "talk",
        "title": "From crontab to celery with no regrets",
        "author": "Marco Pavanelli",
        "others": "Do not know yet",
        "abstract": "Cron jobs are great! they can save your life and your marriage, they run day and night with any weather and they never miss a shot. But when they become too many it can be a real mess and have you ever tried running a cron job in a container ?\n\nThe first time I tried Celery I was a bit frustrated, setup is not exactly straight forward and the first time can be really hard but if do not give up the final result is amazing and you will end up with a huge power in your hands.",
        "bio": "I am senior python dev and agile product owner, I have been working in IT for more that 30 years. Since 2021 I work for Sasa Spa in Bolzano Italy where we develop software for helping managing public transport in the South Tyrol region. In my team we have a strong experience in running python and django inside containers.",
        "level": "Intermediate",
        "linkedin": "https://www.linkedin.com/in/marco-pavanelli-8b054470/",
        "picture": "images/speakers/Marco_Pavanelli.jpg"
    },
    {
        "cfp_type": "talk",
        "title": "Pytest vs Robot, A battle or Co-existence. ",
        "author": "Vivek Mohan",
        "others": "",
        "abstract": "With the great momentum in python adoption in industries\n there is always a dielema on which test framework to choose among \npytest and  robot . I would like to share some perspectives of how the  \nworld would look like if these co-existed under one roof .What would a live migration from one to another look like? Effort vs Gain vs Loss.  No verdicts just fun paradoxes!",
        "bio": "Building and maintaining Automation Tools for securing the quality of an\n ultra cool service within Volvo Cars keeps me busy during the day and \nsome nights! Have been part of similar journey with the likes of \nEricsson, Volvo Trucks  in the past.",
        "level": "Advanced",
        "picture": "images/speakers/Vivek_Mohan.jpg"
    },
    {
        "cfp_type": "talk",
        "title": "Interactive Lectures and Active Learning with Python in Scientific Computing",
        "author": "Jonas Lindemann",
        "others": "",
        "abstract": "Teaching programming can be significantly improved if lectures and courses use concepts from active learning. During the last years, I have transitioned from static to interactive slides using Jupyter Notebooks, where students can interact with the material during the lecture. The lectures also contain exercises that the students can perform during the lecture to reinforce their learning process. In some of our libraries, we have also developed interactive functions that enable the students to quickly modify parameters in the computational codes.",
        "bio": "Jonas Lindemann, Director at LUNARC. Jonas has a background in Structural Mechanics where he worked on distributed finite element applications, new user interface concepts for engineering application as well as visualisation of material behavior in mechanical simulations. Since 2004 he has been working at LUNARC designing, implementing and operating HPC resources for Lund University. He is also actively engaged in teaching scientific computing (Python, C++ and Fortran) for graduate as well as post graduate students. At LUNARC he has been the main developer of GfxLauncher and multiple other HPC related tools (ARC Storage Explorer, LUNARC Application portal and ml-browse a graphical module browser for lmod).",
        "level": "Intermediate",
        "twitter": "twitter.com/jonas_lindemann",
        "linkedin": "https://www.linkedin.com/in/jonas-lindemann-8632343/",
        "picture": "images/speakers/Jonas_Lindemann.jpg"
    },
    {
        "cfp_type": "talk",
        "title": "I hate writing tests, that's why I use Hypothesis",
        "author": "Cheuk Ting Ho",
        "others": "",
        "abstract": "Ok, I lied, I still write tests. But instead of the example-based tests that we normally write, have you heard of property-based testing? By using Hypothesis, instead of thinking about what data I should test it for, it will generate test data, including boundary cases, for you.",
        "bio": "Before working in Developer Relations, Cheuk has been a Data Scientist in various companies which demands high numerical and programmatical skills, especially in Python. To follow her passion for the tech community, now Cheuk is the Developer Advocate for Anaconda.\n\nBesides her work, Cheuk enjoys speaking at various conferences. Cheuk also organises events for developers. Cheuk has organised conferences including EuroPython (of which she is a board member), PyData Global and Pyjamas Conf. Believing in Tech Diversity and Inclusion, Cheuk constantly organizes workshops and mentored sprints for minority groups. In 2021, Cheuk has become a Python Software Foundation fellow.",
        "level": "Novice",
        "twitter": "https://twitter.com/cheukting_ho",
        "linkedin": "https://www.linkedin.com/in/cheukting-ho",
        "picture": "images/speakers/Cheuk_Ting_Ho.jpg"
    },
    {
        "cfp_type": "talk",
        "title": "\"Python for Everyone\", yes it is",
        "author": "Anwesha Das",
        "others": "",
        "abstract": "\"Python for Everyone\" is a program I came up to help women from immigrant communities & for people who are from other industry, to move into IT. I will talk about how & what I am organizing as part of PyLadies Stockholm, problems, successes and how to improve.",
        "bio": "Anwesha Das is Master in Laws by education and technologist by passion. She helps to build and maintain sustainable FOSS communities through out the globe with her legal,\ntechnical, organizational and community skills. Maintaining and learning about\nsystems infrastructure is something she is passionate about. She is also a regular speaker\nin various conferences around the world. She is co-organizer at PyLadies Stockholm. She regularly blogs at https://anweshadas.in.",
        "level": "Novice",
        "twitter": "twitter.com/anweshasrkr",
        "linkedin": "https://www.linkedin.com/in/anwesha-das-1247121a2/",
        "picture": "images/speakers/Anwesha_Das.jpg"
    },
    {
        "cfp_type": "talk",
        "title": "Building Python Data Apps using Gradio",
        "author": "Merve Noyan",
        "others": "",
        "abstract": "For most of the workflows involving data and machine learning, it's hard for data professionals to build web applications to communicate their work. Gradio is a library that helps python users easily create UIs for data or machine learning based applications. In this talk, I'll go through how to use Gradio. ",
        "bio": "Merve is an engineer at developer advocacy team in Hugging Face. She is a Google Developer Expert in machine learning and an open-source developer.",
        "level": "Novice",
        "twitter": "twitter.com/mervenoyann",
        "linkedin": "https://www.linkedin.com/in/merve-noyan-28b1a113a/",
        "picture": "images/speakers/Merve_Noyan.jpg"
    },
    {
        "cfp_type": "talk",
        "title": "Widening Natural Language Processing: training Watson Nordic Languages",
        "author": "Anna K. Lindegren and Sara Elo Dean",
        "others": "Sara Elo Dean",
        "abstract": "In this talk we will go through the process of training Watson IBM for Nordic languages in 2020- 2021. We will explain how to teach AI to understand language as we humans do , see how Watson NLP works on practice in comparison with other open libraries and  discuss Ethics in NLP and the future of NLP technology.",
        "bio": "Sara Elo Dean, Watson Delivery Solution Architect, IBM Finland;  Anna K. Lindegren, Data & AI Technical Specialist, IBM Sweden",
        "level": "Intermediate",
        "picture": "images/speakers/Anna_Lindegren_and_Sara_Dean.jpg"
    },
    {
        "cfp_type": "talk",
        "title": "PyScript - what you need to know.",
        "author": "Nicholas H.Tollervey",
        "others": "",
        "abstract": "PyScript is an open source project to bring Python to the browser - the most ubiquitous computing platform in the world. This talk introduces PyScript, explains how it works, the current state of development and what you can expect to see coming in the short, medium and long term.",
        "bio": "Nicholas is a classically trained musician, philosophy graduate, teacher, writer and software developer. He's just like this biography: concise, honest and full of useful information. He's also a principal engineer on the PyScript team at Anaconda.",
        "level": "Novice",
        "picture": "images/person-dummy.jpg"
    },
    {
        "cfp_type": "talk",
        "title": "A Python Introduction to Behavior Driven Development",
        "author": "Meder Kamalov",
        "others": "",
        "abstract": "Behavior Driven Development (BDD) is a testing practice that makes it easy for developers, managers and QA testers to keep track of the key features in a programming project. The talk will provide an introduction to BDD and show to how incorporate it into a project by using `behave`.",
        "bio": "Software Engineer at Features and Labels. Building tools for the Modern Data Stack.",
        "level": "Intermediate",
        "twitter": "twitter.com/mederka",
        "linkedin": "https://www.linkedin.com/in/mederka/",
        "picture": "images/speakers/Meder_K.jpg"
    },
    {
        "cfp_type": "talk",
        "title": "Securing python applications with open-source tools",
        "author": "Oleksandr Vasylenko",
        "others": "",
        "abstract": "Authentication and authorization layers are core features of every product. For many enterprise products the selection of proper solution for authentication and authorization becomes mandatory task from the first days. Keycloak provides robust and tested IDP solution, which is easy to integrate with many frameworks. In this talk I will share our experience using Keycloak for python-based applications",
        "bio": "Oleksandr Vasylenko is Principal Engineer at Anaconda, working on enterprise repository products. Prior to joining Anaconda, Alex worked at Zalando, helping to optimize Retail preorders with ML algorithms. Currently he is living in Berlin with his family.",
        "level": "Intermediate",
        "linkedin": "https://www.linkedin.com/in/oleksandr-vasylenko-se/",
        "picture": "images/speakers/Oleksandr_Vasylenko.jpg"
    },
    {
        "cfp_type": "keynote",
        "title": "Reinventing Machine Learning with Transformers and Hugging Face",
        "author": "Julien Simon",
        "others": "",
        "abstract": "According to the 2021 State of AI report, \"transformers have emerged as a general-purpose architecture for ML. Not just for Natural Language Processing, but also Speech, Computer Vision or even protein structure prediction.\" Indeed, the Transformer architecture has proven very efficient on a wide variety of Machine Learning tasks. But how can we keep up with the frantic pace of innovation? Do we really need expert skills to leverage these state-of-the-art models? Or is there a shorter path to creating business value in less time? In this code-level talk, we'll show you how to quickly build and deploy machine learning applications based on state-of-the-art Transformers models. Along the way, you'll learn about the portfolio of open source and commercial Hugging Face solutions, and how they can help you deliver high-quality machine learning solutions faster than ever before.",
        "bio": "Julien Simon is currently Chief Evangelist at Hugging Face. He’s recently spent 6 years at Amazon Web Services where he was the Global Technical Evangelist for AI & Machine Learning. Prior to joining AWS, Julien served for 10 years as CTO/VP Engineering in large-scale startups.",
        "level": "",
        "picture": "images/speakers/Julien_Simon.jpg"
    },
    {
        "cfp_type": "keynote",
        "title": "Enhance your work with graph database",
        "author": "Tetiana Kolmychek",
        "others": "",
        "abstract": "Data is an essential part of our work, be it data \nscience, development, UI/product design. It comes in different forms and\n shapes, represents different concepts and ideas, yet more often than \nnot we stick to limited amount of ways to represent, store, visualize, \nand query it.\nGraph\n databases provide a different perspective on the data that we have, and\n a way to represent it that puts focus on relationships between \nentities, highlighting that which might be otherwise overlooked. This \ncan help us to find optimal, simple, and elegant solutions to what might\n appear to be a hard problem otherwise.\nIn\n this presentation I would like to share the knowledge and experience of\n the past few years of me working on applying graph databases to the \ndata and problems, in hope that it will help more people to look at \ntheir data in a different way.",
        "bio": "Developer and machine learning engineer with more than 10 years of experience in various areas of the tech. For the past 2 years Tetiana has been working for the Swedish tech company Fishbrain, the world's most popular fishing app. Math and data have been Tetiana's passion from a young age. She believes that focus on data quality and the right data representation are important setting stones for successful projects.",
        "level": "",
        "picture": "images/speakers/Tetiana_Kolmychek.jpg"
    },
    {
        "cfp_type": "keynote",
        "title": "Data Literacy",
        "author": "Magnus Perman",
        "others": "",
        "abstract": "Data is becoming one of the most valuable assets of companies and \norganisations. Needless to say, the importance of being able to work \nwith data is also increasing.\nTo be data literate is about being able to understand and draw \ninsights from data. Python is a key enabler in building the foundation \nfor this.\n\nIn this session I will go through some different levels of data \nliteracy and how more people can get inspired to work with data and \ninsights with the help of Python.",
        "bio": "Magnus Perman works as a Competence Unit Manager and Tech Lead for Data Science at the Swedish tech company Nexer. He holds a M.Sc. in Computer Science and has over 15 years experience of working with global clients delivering solutions within the areas of Business Intelligence, Data Warehousing, Analytics and Data Science. During the last years he has been a speaker at the Analytics and Data Summit in San Francisco and at various other conferences in Sweden including PyCon. In his free time, other than hanging out with his family and friends, he likes to play tennis and padel.",
        "level": "",
        "picture": "images/speakers/Magnus_Perman.jpg"
    },
    {
        "cfp_type": "keynote",
        "title": "Discover semantic topics in a collection of documents by leveraging open source projects",
        "author": "Gabriela Zarzar Gandler",
        "others": "",
        "abstract": "Transformer-based language models have been revolutionizing the field of\n natural language understanding. In this talk, I will showcase how \npublicly available language models can be used to discover semantically \nvalid topics from a collection of unstructured texts. This technique is \ncalled topic modeling, and can help organize and offer insights to \nunderstand large collections of documents. Welcome! ",
        "bio": "Gabriela Zarzar Gandler works as Senior ML Data Scientist at King, and joined King via the recent acquisition of Peltarion. At Peltarion she translated machine learning and natural language processing research into valuable technology to partners in the industry and public sector. Gabriela holds a master degree in machine learning and has previously worked at Looklet, ABB Corporate Research Center, BASF and Bosch und Siemens Hausgeräte. She is passionate about building great solutions with great people, and using data to reinterpret the reality around us.",
        "level": "",
        "picture": "images/speakers/Gabriela_Gandler.jpg"
    },
    {
        "cfp_type": "talk ",
        "title": "Keeping up with the renewable energy transition: Using python and forecasting to maintain a balanced Nordic power system",
        "author": "Samuel Eliasson Godonou",
        "others": "",
        "abstract": "As the transmission system operator, one of the main tasks of Svenska Kraftnät is to ensure the continuous balance in the power system. This is becoming increasingly complex due to e.g. the increased cooperation between the EU countries, and their energy transition goals. Because of this, Svenska Kraftnät and its Norwegian counterpart is developing a Python based framework for forecasting. By anticipating the imbalance ahead of time, it is possible to automatically procure balancing resources and maintain a stable power system. We will give a background, present the framework and demonstrate some examples and lessons learned from imbalance forecasting.",
        "bio": "Data Scientist at Svenska Kraftnät",
        "level": "Intermediate",
        "linkedin": "https://www.linkedin.com/in/samuel-eliasson-godonou-67475612b/",
        "picture": "images/speakers/Samuel_Eliasson_Godonou.jpg"
    },
    {
        "cfp_type": "talk",
        "title": "Working smarter to fight cancer: using dunder special methods to automate code generation",
        "author": "Ryan Hill",
        "others": "",
        "abstract": "Anocca has developed a set of novel biotechnologies for deciphering and harnessing the human adaptive immune system to treat cancers. To support our biotech, we have created an information management system and a suite of automated data processing pipelines. The backend is built with Django, Celery, PostgreSQL and a GraphQL API. At Anocca we have a “smarter-not-harder” approach to our development process. We will present the use of the __init_subclass__​ and type​ special methods to automate schema and class generation, reducing boilerplate and repetitive code in our codebase.",
        "bio": "Ryan Hill, CIO Anocca",
        "level": "Intermediate",
        "picture": "images/person-dummy.jpg"
    },
    {
        "cfp_type": "workshop",
        "title": "Hyper-productive NLP with Hugging Face Transformers",
        "author": "Julien Simon",
        "others": "",
        "abstract": "In this session, we'll walk through a complete end-to-end example of using Hugging Face Transformers, involving both our open-source libraries and some of our commercial products. Starting from a dataset containing real-life product reviews from Amazon.com, we'll train and deploy a text classification model predicting the star rating for similar reviews. Along the way, you'll learn how to:- Explore models and datasets on the Hugging Face Hub, - Load, prepare and save datasets with the Hugging Face datasets library, - Load, train and save models with the Hugging Face transformers library, - Build ML applications with Hugging Spaces to showcase your models, - Use hardware acceleration with the Hugging Face Optimum library to optimize training and prediction times, - and maybe a few more things, if we have time! Of course, all code will be shared with you, and you'll be able to use it easily in your own projects.",
        "bio": "Julien Simon is currently Chief Evangelist at Hugging Face. He’s recently spent 6 years at Amazon Web Services where he was the Global Technical Evangelist for AI & Machine Learning. Prior to joining AWS, Julien served for 10 years as CTO/VP Engineering in large-scale startups.",
        "level": "",
        "picture": "images/speakers/Julien_Simon.jpg"
    }
]
